Before staring please go through the "About Dataset file" and the dataset also for better uderstanding

# Step 1: Import Libraries and Load the Dataset

In [2]:
import pandas as pd

# Load the toy dataset
df = pd.read_csv('mini_project_dataset.csv')

# Display the first few rows to understand the data
print(df.head())

   ID    Name   Age Gender   Salary Department
0   1   Rahul  28.0      M  50000.0         IT
1   2   Priya   NaN      F  60000.0         HR
2   3   Arjun  35.0      M      NaN      Sales
3   4    Asha  22.0      F  55000.0         IT
4   5  Suresh  40.0      M  70000.0         HR

# Step 2: Initial Exploration and Assessment
### Understand the dataset by checking for missing values, duplicates, and basic statistics.

In [3]:
# Check for missing values
print(df.isnull().sum())

ID            0
Name          1
Age           1
Gender        0
Salary        2
Department    1
dtype: int64

In [4]:
# Check for duplicates
print("Number of duplicates:", df.duplicated().sum())

Number of duplicates: 0

In [5]:
# Basic statistics
print(df.describe())

             ID        Age        Salary
count  10.00000   9.000000      8.000000
mean    5.50000  30.333333  57250.000000
std     3.02765   5.315073   6984.677107
min     1.00000  22.000000  48000.000000
25%     3.25000  28.000000  53750.000000
50%     5.50000  29.000000  56500.000000
75%     7.75000  33.000000  60500.000000
max    10.00000  40.000000  70000.000000

# Step 3: Handling Missing Values

### Decide how to handle missing values based on the nature of your data. Here we are filling with mean.

In [6]:
# Fill missing age values with the mean
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age, inplace=True)

In [7]:
# Fill missing salary values with the mean
mean_salary = df['Salary'].mean()
df['Salary'].fillna(mean_salary, inplace=True)

In [8]:
# Drop rows with missing name and department values
df.dropna(subset=['Name', 'Department'], inplace=True)

In [9]:
# Checking the changes
df.head(10)

   ID     Name        Age Gender   Salary Department
0   1    Rahul  28.000000      M  50000.0         IT
1   2    Priya  30.333333      F  60000.0         HR
2   3    Arjun  35.000000      M  57250.0      Sales
3   4     Asha  22.000000      F  55000.0         IT
4   5   Suresh  40.000000      M  70000.0         HR
5   6  Pallabi  26.000000      F  48000.0      Sales
8   9    Anita  33.000000      F  57250.0      Sales
9  10   Vikram  28.000000      M  58000.0         HR

The 7th and 8th ID row has been removed as it has missing values in the NAME and Department column
and the other missing values of Age and Salary is filled with mean values.

In [10]:
print(df.isnull().sum())

ID            0
Name          0
Age           0
Gender        0
Salary        0
Department    0
dtype: int64

# Step 4: Removing Duplicates
### Remove duplicate rows if necessary.

In [11]:
# Remove duplicate rows
# df.drop_duplicates(inplace=True) # Since we don't have any duplicates, that's why not using this line of code

# Step 5: Save Cleaned Data
### Save the cleaned dataset for future analysis.

In [24]:
# Save the cleaned data to a new CSV file
df.to_csv('cleaned_mini_project_dataset.csv', index=False)